out/production/LeetCodeAndCrackingCodingInterview/Test/SOAPResponse.xml.fxml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:CrossGatewayQuery</a:Action>
        <a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo>
        <a:To s:mustUnderstand="1">SOAPENDPOINT</a:To>
    </s:Header>
    <s:Body>
        <AdhocQueryRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
            <ResponseOption returnType="LeafClass" />
            <AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
                <Slot name="$XDSDocumentEntryType"><ValueList><Value>('urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1')</Value></ValueList></Slot>
                <Slot name="$XDSDocumentEntryPatientId"><ValueList><Value>MRN_VALUE^^^&amp;OID_VALUE&amp;ISO</Value></ValueList></Slot>
                <Slot name="$XDSDocumentEntryStatus"><ValueList><Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved', 'urn:ihe:iti:2010:StatusType:DeferredCreation')</Value></ValueList></Slot>
                <Slot name="$XDSDocumentEntryCreationTimeFrom"><ValueList><Value></Value></ValueList></Slot>
                <Slot name="$XDSDocumentEntryCreationTimeTo"><ValueList><Value></Value></ValueList></Slot>
            </AdhocQuery>
        </AdhocQueryRequest>
    </s:Body>
</s:Envelope>
